Tekla Open API Reference for Tekla Structures 2025
FormBorders.IsOnActiveDisplays Method
 Checks form quadrants to be sure full extents is on a single screen
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsOnActiveDisplays(
	Form form
)
Public Shared Function IsOnActiveDisplays (
	form As Form
) As Boolean
Parameters
form
Type: System.Windows.Forms.Form
The form in question.
Return Value
Type: Boolean
True if fully contained in a screen
See Also
Reference
FormBorders Class
Tekla.Structures.Dialog Namespace